cases/droplets2D/0.org/alphaVapor
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphaVapor;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1.0;

boundaryField
{
    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 1.0;
        value           uniform 1.0;
    }
        
    frontAndBack
    {
        type            symmetryPlane;
    }
    
    defaultFaces
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
