cases/droplets2D/system/VOFSetFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      VOFSetFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultSpecies
(
    N2   1.0
);

droplets
(
    DropMMH
    {
        center   (0 0.003 0.00411);
        radius   (0 0.001 0.001);
        delVapor 1e-4;
        U        (0 0 -1);
        liquidSpecies
        (
            CH3NHNH2L  1.0
        );
        vaporSpecies
        (
            CH3NHNH2   0.05
        );
    }
    
    DropNTO
    {
        center   (0 0.003 0.00189);
        radius   (0 0.001 0.001);
        delVapor 1e-4;
        U        (0 0 1);
        liquidSpecies
        (
            N2O4L  1.0
        );
        vaporSpecies
        (
            N2O4   0.90
            NO2    0.09
        );
    }

);


// ************************************************************************* //
